thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
/*
 * nrf9160.c
 *
 *  Created on: Oct 3, 2024
 *      Author: phb10
 */

#include <nrf9160.h>
#include "stm32u5xx_hal.h"
#include <main.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>
#include <ctype.h>
#define MINMEA_MAX_SENTENCE_LENGTH 256

uint8_t uart_cat_m1_buf[MINMEA_MAX_SENTENCE_LENGTH] = {0, };

cat_m1_Status_t cat_m1_Status;
uart_cat_m1_t uart_cat_m1_rx;
cat_m1_at_cmd_rst_t cat_m1_at_cmd_rst;
cat_m1_Status_Band_t cat_m1_Status_Band;
cat_m1_Status_BandAlert_t cat_m1_Status_BandAlert;
cat_m1_Status_FallDetection_t cat_m1_Status_FallDetection;
cat_m1_Status_GPS_Location_t cat_m1_Status_GPS_Location;
cat_m1_Status_IMU_t cat_m1_Status_IMU;
cat_m1_Status_BandSet_t cat_m1_Status_BandSet;
cat_m1_Status_uuid_t cat_m1_Status_uuid;
cat_m1_Status_Fall_Difference_Value_t cat_m1_Status_Fall_Difference_Value;

WpmState currentWpmState = WPM_INIT_CHECK;
CheckState currentCheckState = SYSTEM_MODE_CHECK;
MqttState currentMqttState = MQTT_INIT;
GpsState gpsState = GPS_INIT;

extern uint8_t nRFCloudFlag;
extern bool cell_locationFlag;
extern uint8_t wpmInitializationFlag;
extern int gpsOffCheckTime;
extern int UartRxRetryTime;
extern int gps_operation_cycle;
extern uint32_t deviceID;
extern uint8_t deviceID_check;
extern uint8_t gpsRSSI_0_1;
extern bool gpsSendFlag;

bool txCompleteFlag = 0;

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART1)
    {
        txCompleteFlag = 1;
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART1)
    {
    	push(&uart_cat_m1_rx, uart_cat_m1_rx.temp);
    	HAL_UART_Receive_IT(&huart1, &uart_cat_m1_rx.temp, 1);
    }
}

void clear_uart_buf(uart_cat_m1_t*u)
{
  u->head = 0;
  u->tail = 0;
  memset(u->buffer, 0, sizeof(u->buffer));
}

void push(uart_cat_m1_t* u, uint8_t data)
{
  u->buffer[u->head] = data;

  u->head++;

  if (u->head >= CAT_M1_UART_BUF_SIZE)
  {
    u->head = 0;
  }
}

uint8_t pop(uart_cat_m1_t* u)
{
  uint8_t data = u->buffer[u->tail];

  u->tail++;

  if (u->tail >= CAT_M1_UART_BUF_SIZE)
  {
    u->tail = 0;
  }
  return data;
}

uint8_t isEmpty(uart_cat_m1_t* u)
{
  return u->head == u->tail;
}


bool send_at_command(const char *cmd)
{
    cat_m1_Status.txflag = 1;
    txCompleteFlag = 0;

    HAL_UART_Transmit_IT(&huart1, (uint8_t*)cmd, strlen(cmd));
    //PRINT_INFO("TX CMD >>> %s\r\n", cmd);

    while (txCompleteFlag == 0)
    {

    }

    return receive_at_command_ret();
}

bool receive_at_command_ret()
{
//	if (strstr(&uart_cat_m1_rx, str) != NULL)
//    {
//        //PRINT_INFO("RX Data >>> %s\r\n", uart_cat_m1_buf);
//        return true;
//    }
	if(cat_m1_Status.parseResult)
	{
		return true;
	}
	else if(cat_m1_Status.parseResult == 0)
	{
		return false;
	}
	return false;
}

bool receive_response(void)
{
    if (isEmpty(&uart_cat_m1_rx) == 0)
    {
    	cat_m1_Status.txflag = 0;
        uart_cat_m1_rx.rxd = pop(&uart_cat_m1_rx);

        if (uart_cat_m1_rx.rxd == '\r' || uart_cat_m1_rx.rxd == '\n')
        {
            uart_cat_m1_buf[cat_m1_Status.parseCount] = uart_cat_m1_rx.rxd;
            cat_m1_Status.parseCount++;

            //PRINT_INFO("RX Data >>> %s\r\n", uart_cat_m1_buf);
            cat_m1_parse_process(uart_cat_m1_buf);

            memset(&uart_cat_m1_buf, 0, MINMEA_MAX_SENTENCE_LENGTH);
            cat_m1_Status.parseCount = 0;
        } else
        {
            if (cat_m1_Status.parseCount < MINMEA_MAX_SENTENCE_LENGTH - 1) {
                uart_cat_m1_buf[cat_m1_Status.parseCount] = uart_cat_m1_rx.rxd;
                cat_m1_Status.parseCount++;
            }
        }
    }
    return true;
}

bool cat_m1_parse_process(uint8_t *msg) {
    if (!msg) return false;

    char command[MAX_CMD_LEN] = {0};
    char value[MAX_VALUE_LEN] = {0};

    char *colon_pos = strchr((char *)msg, ':');

    if (colon_pos) {
        size_t cmd_len = colon_pos - (char *)msg;
        strncpy(command, (char *)msg, cmd_len < MAX_CMD_LEN ? cmd_len : MAX_CMD_LEN - 1);
        command[cmd_len < MAX_CMD_LEN ? cmd_len : MAX_CMD_LEN - 1] = '\0';

        colon_pos++;
        int i = 0;
        while (i < MAX_VALUE_LEN - 1 && strncmp(colon_pos, "OK", 2) != 0 &&
               strncmp(colon_pos, "ERROR", 5) != 0 && strncmp(colon_pos, "Ready", 5) != 0) {
            if (*colon_pos == '\0' || *colon_pos == '\r' || *colon_pos == '\n') break;
            value[i++] = *colon_pos++;
        }
        value[i] = '\0';

        cat_m1_parse_result(command, value);

        if (strstr(command, "%XICCID") != NULL){
        	if(sizeof(value) < 20){
        		send_at_command("AT%XICCID\r\n");
        	}
        }

    } else {
        if (strstr((char *)msg, "Ready")) {
            PRINT_INFO("Response: Ready\r\n");
            cat_m1_Status.parseResult = 1;
            cat_m1_Status.bootCount++;
            cat_m1_Status.retryCount = 0;
            wpmInitializationFlag = 1;

            PRINT_INFO("cat_m1_Status.bootCount >>> %d\r\n", cat_m1_Status.bootCount);
            if (cat_m1_Status.bootCount >= 2) {
                catM1Reset();
            }
        } else if (strstr((char *)msg, "OK")) {
            PRINT_INFO("Response: OK\r\n");
            cat_m1_Status.parseResult = 1;
            cat_m1_Status.errorCount = 0;
            cat_m1_Status.retryCount = 0;
            wpmInitializationFlag = 1;
        } else if (strstr((char *)msg, "ERROR")) {
            PRINT_INFO("Response: ERROR\r\n");
            cat_m1_Status.parseResult = 0;
            cat_m1_Status.errorCount++;
            if (cat_m1_Status.errorCount >= 10) {
                catM1Reset();
            }
        }
    }
    return false;
}

void cat_m1_parse_result(const char *command, const char *value)
{
	//PRINT_INFO("Command: %s\r\n", command);
	//PRINT_INFO("Value: %s\r\n", value);

	if (!command || !value)
    	return;

    if (strstr(command, "+COPS") != NULL)
    {
        handle_cops_command(value);
    }
    else if (strstr(command, "+CFUN") != NULL)
    {
        handle_cfun_command(value);
    }
    else if (strstr(command, "%XSYSTEMMODE") != NULL)
    {
        handle_system_mode_command(value);
    }
    else if (strstr(command, "#XMQTTCFG") != NULL)
    {
        handle_mqtt_cfg_command(value);
    }
    else if (strstr(command, "+CGDCONT") != NULL)
    {
        handle_cgdcont_command(value);
    }
    else if (strstr(command, "%XICCID") != NULL)
    {
        handle_iccid_command(value);
    }
    else if (strstr(command, "%XMONITOR") != NULL)
    {
        handle_monitor_command(value);
    }
    else if (strstr(command, "+CESQ") != NULL)
	{
		handle_cesq_command(value);
	}
    else if (strstr(command, "#XGPS") != NULL)
    {
        handle_gps_command(value);
    }
    else if (strstr(command, "#XMQTTEVT") != NULL)
    {
        handle_mqtt_event_command(value);
    }
    else if (strstr(command, "+CCLK") != NULL)
    {
        handle_cclk_command(value);
    }
    else if (strstr(command, "#XNRFCLOUDPOS") != NULL)
    {
    	handle_cell_location_command(value);
    }
    else if (strstr(command, "#XUUID") != NULL)
    {
    	handle_xuuid_command(value);
    }
    else if (strstr(command, "+CNUM") != NULL)
    {
    	handle_cnum_command(value);
    }
}

void handle_cops_command(const char *value)
{
    int cops_length = strlen(value);
    cat_m1_Status.connectionStatus = (cops_length > 5) ? 1 : 0;
    strncpy((char *)cat_m1_at_cmd_rst.cops, (const char *)value, MAX_VALUE_LEN - 1);
    cat_m1_at_cmd_rst.cops[MAX_VALUE_LEN - 1] = '\0';
}

void handle_cfun_command(const char *value)
{
	cat_m1_Status.cfunStatus = (strstr(value, "1") != NULL) ? 1 : 0;
}

void handle_system_mode_command(const char *value)
{
    if (strstr(value, "1,0,0,0") != NULL)
    {
    	cat_m1_Status.systemModeStatus = 1;
    }
    else if (strstr(value, "0,0,1,0") != NULL)
    {
    	cat_m1_Status.systemModeStatus = 2;
    }
    else if (strstr(value, "1,0,1,0") != NULL)
    {
    	cat_m1_Status.systemModeStatus = 3;
    }
}

void handle_mqtt_cfg_command(const char *value)
{
    int mqttcfg_length = strlen(value);
    cat_m1_Status.mqttSetStatus = (mqttcfg_length > 5) ? 1 : 0;
}

void handle_cgdcont_command(const char *value)
{
	strncpy((char *)cat_m1_at_cmd_rst.cgdcont, (const char *)value, MAX_VALUE_LEN - 1);
	cat_m1_at_cmd_rst.cgdcont[MAX_VALUE_LEN - 1] = '\0';
}

void handle_iccid_command(const char *value)
{
   for (int i = 0; i < ICCID_LEN - 1 && value[i] != '\0'; i++) {
       cat_m1_at_cmd_rst.iccid[i] = value[i];
   }
   cat_m1_at_cmd_rst.iccid[ICCID_LEN - 1] = '\0';

   if (!deviceID_check)
   {
       if (strlen(cat_m1_at_cmd_rst.iccid) >= 20) {
           char *ptr = cat_m1_at_cmd_rst.iccid + 11;
           ptr[9] = '\0';

           deviceID = (uint32_t)strtol(ptr, NULL, 10);

           if (deviceID == 0) {
               HAL_Delay(100);
               deviceID = (uint32_t)strtol(ptr, NULL, 10);

               if (deviceID == 0) {
                   HAL_Delay(100);
                   deviceID = (uint32_t)strtol(ptr, NULL, 10);
               }
               ehg.deviceID = deviceID;
           }

