thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
           if (strlen(cat_m1_at_cmd_rst.iccid) > 20) {
               ptr[9] = cat_m1_at_cmd_rst.iccid[20];
           }
       }

       //PRINT_INFO("deviceID >>> %u\r\n", (unsigned int)ehg.deviceID);
       HAL_Delay(250);
       deviceID_check = 1;
   }
}

void handle_monitor_command(const char *value)
{
    strncpy((char *)cat_m1_at_cmd_rst.networkinfo, (const char *)value, sizeof(cat_m1_at_cmd_rst.networkinfo) - 1);
    cat_m1_at_cmd_rst.networkinfo[sizeof(cat_m1_at_cmd_rst.networkinfo) - 1] = '\0';
}

void handle_cesq_command(const char *value)
{
    strncpy((char *)cat_m1_at_cmd_rst.cesq, (const char *)value, sizeof(cat_m1_at_cmd_rst.cesq) - 1);
    cat_m1_at_cmd_rst.cesq[sizeof(cat_m1_at_cmd_rst.cesq) - 1] = '\0';

    char *token;
    char *str = strdup(value);
    int count = 0;
    int rssi_value = 0;

    token = strtok(str, ",");
    while (token != NULL)
    {
        count++;

        if (count == 6)
        {
        	if((int)atoi(token) != 255)
        	{
            rssi_value = (int)atoi(token);
            cat_m1_at_cmd_rst.rssi = rssi_value - 140;
            break;
        	}
        }
        token = strtok(NULL, ",");
    }

    free(str);
}

void handle_gps_command(const char *value)
{
	int gpsDataLength = strlen(value);
    if (strstr(value, "1,1") != NULL)
    {
      //gpsRSSI_0_1 = 0;
      gpsRSSI_0_1 = 1;
      cat_m1_Status.gpsOn = 1;
      cell_locationFlag = true;
    }
    else if (strstr(value, "1,4") != NULL) {
      gpsSendFlag = 0;
      //gpsRSSI_0_1 = 1;
      gpsRSSI_0_1 = 0;
      cat_m1_Status.gpsOff = 1;
      gps_operation_cycle = (60*10);
      cell_locationFlag = false;
      ehg.gpsFlag = false;
    }
#if !defined(nRF9160_KT)
    else if (strstr(value, "1,3") != NULL || strstr(value, "0,0") != NULL)
#else
    else if (strstr(value, "1,3") != NULL || strstr(value, "1,0") != NULL || strstr(value, "0,0") != NULL)
#endif
    {
      gps_operation_cycle = (60*10);
      gpsRSSI_0_1 = 0;
      cat_m1_Status.gpsOff = 1;
      cell_locationFlag = true;
      ehg.gpsFlag = false;
    }
    else { // strstr(value, "1,4") => after MSG: GPS DATA
      if (gpsDataLength > 10) {
        memset(&cat_m1_at_cmd_rst.gps, 0, sizeof(cat_m1_at_cmd_rst.gps));
        const size_t GPS_BUFFER_SIZE = sizeof(cat_m1_at_cmd_rst.gps);
        char *token;
        char *rest = (char *)value;
        int pos = 0;
        int count = 0;

        char cleaned_token[GPS_BUFFER_SIZE];

        while ((token = strtok_r(rest, ",", &rest)) != NULL) {
          if (token[0] == '"') break;

          int clean_pos = 0;
          for(int i = 0; token[i] != '\0'; i++) {
            if(token[i] != '"') {
              cleaned_token[clean_pos++] = token[i];
            }
          }
          cleaned_token[clean_pos] = '\0';

          int len = strlen(cleaned_token);

          if ((pos + len + 1) < GPS_BUFFER_SIZE) {
            if (count > 0) {
              cat_m1_at_cmd_rst.gps[pos++] = ',';
            }
            strcpy(cat_m1_at_cmd_rst.gps + pos, cleaned_token);
            pos += len;
            count++;
          }
        }
			cat_m1_at_cmd_rst.gps[pos] = '\0';
		}
    }
}

void handle_cell_location_command(const char *value)
{
//	int cell_locationDataLength = strlen(value);
//
//	if (cell_locationDataLength > 10) {
//	    char tempBuffer[sizeof(cat_m1_at_cmd_rst.gps)];
//	    int j = 0;
//
//	    char *token = strtok(value, ",");
//
//	    token = strtok(NULL, ",");
//
//	    if (token != NULL) {
//	        strncpy(tempBuffer, token, sizeof(tempBuffer) - 1);
//	        tempBuffer[sizeof(tempBuffer) - 1] = '\0';
//	        j = strlen(tempBuffer);
//	    }
//
//	    token = strtok(NULL, ",");
//	    if (token != NULL && j < sizeof(tempBuffer) - 1) {
//	        strncat(tempBuffer, ",", sizeof(tempBuffer) - j - 1);
//	        strncat(tempBuffer, token, sizeof(tempBuffer) - j - 2);
//	    }
//
//	    strncpy((char *)cat_m1_at_cmd_rst.gps, tempBuffer, sizeof(cat_m1_at_cmd_rst.gps) - 1);
//	    cat_m1_at_cmd_rst.gps[sizeof(cat_m1_at_cmd_rst.gps) - 1] = '\0';

		strncpy((char *)cat_m1_at_cmd_rst.gps, (const char *)value, sizeof(cat_m1_at_cmd_rst.gps) - 1);
		cat_m1_at_cmd_rst.gps[sizeof(cat_m1_at_cmd_rst.gps) - 1] = '\0';
//	}
}

void handle_xuuid_command(const char *value)
{
	strncpy((char *)cat_m1_at_cmd_rst.uuid, (const char *)value, sizeof(cat_m1_at_cmd_rst.uuid) - 1);
	cat_m1_at_cmd_rst.uuid[sizeof(cat_m1_at_cmd_rst.uuid) - 1] = '\0';
}

void handle_mqtt_event_command(const char *value)
{
    if (strstr(value, "1,-") != NULL) {
    	//catM1Reset();
    	wpmInitializationFlag = 1;
    	cat_m1_Status.Checked = 1;
    	currentMqttState = MQTT_CONNECT;
    }
    else if (strstr(value, "7,0") != NULL)
    {
    	cat_m1_Status.mqttSubscribeStatus++;
    }
    else if (strstr(value, "0,0") != NULL)
    {
    	cat_m1_Status.mqttConnectionStatus = 1;
    }
}

uint8_t timeUpdateFlag = 0;
void handle_cclk_command(const char *value)
{
	strncpy((char *)cat_m1_at_cmd_rst.time, (const char *)value, sizeof(cat_m1_at_cmd_rst.time) - 1);
	cat_m1_at_cmd_rst.time[sizeof(cat_m1_at_cmd_rst.time) - 1] = '\0';
  setTimeUpdatFlag(1);
}

void handle_cnum_command(const char *value)
{
    // 중간 부분만 추출 (국가 코드 뒤 번호만 남기기)
    const char *phone_number = value + 3; // "+46" 이후의 번호 사용
    char formatted_number[20] = {0};      // 변환 후 저장할 버퍼

    // 전화번호를 "1912-1227-5694" 형식으로 변환
    snprintf(formatted_number, sizeof(formatted_number), "%.4s-%.4s-%.4s",
             phone_number, phone_number + 4, phone_number + 8);

    // 변환된 번호를 구조체 멤버에 저장
    strncpy((char *)cat_m1_at_cmd_rst.cnum, formatted_number, sizeof(cat_m1_at_cmd_rst.cnum) - 1);
    cat_m1_at_cmd_rst.cnum[sizeof(cat_m1_at_cmd_rst.cnum) - 1] = '\0';
}


void uart_init()
{
	HAL_UART_Receive_IT(&huart1, &uart_cat_m1_rx.temp, 1);
}

void nrf9160_clear_buf()
{
	clear_uart_buf(&uart_cat_m1_rx);
	memset(&cat_m1_Status, 0, sizeof(cat_m1_Status));
	memset(&cat_m1_at_cmd_rst, 0, sizeof(cat_m1_at_cmd_rst));
	memset(&uart_cat_m1_buf, 0, sizeof(uart_cat_m1_buf));
	memset(&cat_m1_Status_Band, 0, sizeof(cat_m1_Status_Band));
	memset(&cat_m1_Status_BandAlert, 0, sizeof(cat_m1_Status_BandAlert));
	memset(&cat_m1_Status_FallDetection, 0, sizeof(cat_m1_Status_FallDetection));
	memset(&cat_m1_Status_GPS_Location, 0, sizeof(cat_m1_Status_GPS_Location));
	memset(&cat_m1_Status_IMU, 0, sizeof(cat_m1_Status_IMU));
	memset(&cat_m1_Status_BandSet, 0, sizeof(cat_m1_Status_BandSet));
}

