thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
void nrf9160_init()
{
    uart_init();
    PRINT_INFO("nRF9160 initialized\r\n");
}

void nrf9160_ready(void)
{
    switch (currentWpmState)
    {
        case WPM_INIT_CHECK:
            if (!wpmInitializationFlag)
            {
                receive_at_command_ret();
                send_at_command("AT\r\n");
                osDelay(500);

                cat_m1_Status.retryCount++;
                if (cat_m1_Status.retryCount >= 5)
                {
                    PRINT_INFO("Error count exceeded. Initialization failed.\r\n");
                    //currentWpmState = WPM_INIT_COMPLETE;
                    uart_init();
#if !defined(nRF9160_initial_upload)
                    catM1Reset();
#endif
                }
            }
            else
            {
                currentWpmState = WPM_INIT_COMPLETE;
            }
            break;

        case WPM_INIT_COMPLETE:
            PRINT_INFO("WPM initialization completed successfully.\r\n");
            break;
    }
}

void nrf9160_check()
{
    switch (currentCheckState)
    {
        case SYSTEM_MODE_CHECK:
            if (cat_m1_Status.systemModeStatus == 0 || cat_m1_Status.systemModeStatus == 2)
            {
                send_at_command("AT+CFUN=0\r\n");
#if defined(nRF9160_KT)
                send_at_command("AT+COPS=1,2,\"45008\"\r\n");
                send_at_command("AT%XSYSTEMMODE=1,0,1,0\r\n");
                send_at_command("AT+CPSMS=1,,,\"00000001\",\"00000011\"\r\n");
                send_at_command("AT+CEDRXS=2,4,\"0011\"\r\n");
#else
                send_at_command("AT+COPS=0,2\r\n");
                send_at_command("AT%XSYSTEMMODE=1,0,0,0\r\n");
                send_at_command("AT+CPSMS=0\r\n");
                send_at_command("AT+CEDRXS=0\r\n");
#endif
                osDelay(1000);
                send_at_command("AT%XSYSTEMMODE?\r\n");
                osDelay(200);
                cat_m1_Status.retryCount++;
                if (cat_m1_Status.retryCount >= 300)
                {
                    PRINT_INFO("System mode check failed.\r\n");
                    currentCheckState = CHECK_COMPLETE;
                    break;
                }
            }
            else
            {
                currentCheckState = CFUN_CHECK;
                cat_m1_Status.retryCount = 0;
            }
            break;

        case CFUN_CHECK:
            if (!cat_m1_Status.cfunStatus)
            {
                send_at_command("AT+CFUN=1\r\n");
                osDelay(1000);
                send_at_command("AT+CFUN?\r\n");
                osDelay(200);
                cat_m1_Status.retryCount++;
                if (cat_m1_Status.retryCount >= 300)
                {
                    PRINT_INFO("CFUN check failed.\r\n");
                    currentCheckState = CHECK_COMPLETE;
                    break;
                }
            }
            else
            {
            	cat_m1_Status.cfunStatus = 0;
                currentCheckState = CONNECTION_CHECK;
                cat_m1_Status.retryCount = 0;
            }
            break;

        case CONNECTION_CHECK:
            if (!cat_m1_Status.connectionStatus)
            {
                send_at_command("AT+COPS?\r\n");
                osDelay(500);

                cat_m1_Status.retryCount++;
                if (cat_m1_Status.retryCount >= 60 * 10)
                {
                    PRINT_INFO("Connection check failed.\r\n");
                    currentCheckState = CHECK_COMPLETE;
                    break;
                }
            }
            else
            {
                currentCheckState = FINAL_COMMANDS;
                cat_m1_Status.retryCount = 0;
            }
            break;

        case FINAL_COMMANDS:

			send_at_command("AT+CNUM\r\n");
        	send_at_command("AT#XNRFCLOUD=1\r\n");

            send_at_command("AT+CGDCONT?\r\n");
            osDelay(200);
            send_at_command("AT%XICCID\r\n");
            osDelay(200);

            currentCheckState = CHECK_COMPLETE;
            PRINT_INFO("All checks completed.\r\n");
            break;

        case CHECK_COMPLETE:
            cat_m1_Status.Checked = 1;
            break;
    }
}

void nrf9160_mqtt_setting()
{
    switch (currentMqttState) {
        case MQTT_INIT:
            cat_m1_Status.retryCount = 0;
            currentMqttState = MQTT_CONFIG;
            break;

        case MQTT_CONFIG:
            if (!cat_m1_Status.mqttSetStatus)
            {
                send_at_command("AT#XMQTTCFG=\"\",300,1\r\n");
                osDelay(1500);
                send_at_command("AT#XMQTTCFG?\r\n");
                osDelay(100);
                cat_m1_Status.retryCount++;

                if (cat_m1_Status.retryCount >= 10)
                {
                	catM1Reset();
                    //currentMqttState = MQTT_COMPLETE;
                }
            }
            else
            {
                currentMqttState = MQTT_CONNECT;
            }
            break;

        case MQTT_CONNECT:
            if (cat_m1_Status.mqttConnectionStatus == 0)
            {
                send_at_command("AT#XMQTTCON=1,\"\",\"\",\"3.37.65.94\",18831\r\n");
                osDelay(5000);
                cat_m1_Status.retryCount++;

                if (cat_m1_Status.retryCount >= 30)
                {
                	catM1Reset();
                    //currentMqttState = MQTT_COMPLETE;
                }
            }
            else
            {
                //currentMqttState = MQTT_SUBSCRIBE_STATUS;
            	currentMqttState = MQTT_COMPLETE;

            }
            break;

//        case MQTT_SUBSCRIBE_STATUS:
//            if (cat_m1_Status.mqttSubscribeStatus == 0)
//            {
//                send_at_command(SUB_STATUS_BANDSET);
//                osDelay(1000);
//                cat_m1_Status.retryCount++;
//
//                if (cat_m1_Status.retryCount >= 30)
//                {
//                	catM1Reset();
//                    //currentMqttState = MQTT_COMPLETE;
//                }
//            }
//            else
//            {
//                currentMqttState = MQTT_SUBSCRIBE_ALERT;
//            }
//            break;
//
//        case MQTT_SUBSCRIBE_ALERT:
//            if (cat_m1_Status.mqttSubscribeStatus == 1)
//            {
//                send_at_command(SUB_SERVER_ALERT);
//                osDelay(1000);
//                cat_m1_Status.retryCount++;
//
//                if (cat_m1_Status.retryCount >= 30)
//                {
//                	catM1Reset();
//                    //currentMqttState = MQTT_COMPLETE;
//                }
//            }
//            else
//            {
//                currentMqttState = MQTT_COMPLETE;
//            }
//            break;

        case MQTT_COMPLETE:
        	osDelay(5000);
            cat_m1_Status.Checked = 2;
            break;
    }
}

void nrf9160_mqtt_test()
{
	send_at_command("AT#XMQTTPUB=\"topic/slm/pub\",\"Hi~ from nRF9160\",0,0\r\n");
	osDelay(500);
}

void test_send_json_publish(void)
{
	send_at_command("AT#XMQTTCON=1,\"\",\"\",\"3.37.65.94\",18831\r\n");
	osDelay(300);
	send_at_command("AT%XMONITOR\r\n");

