thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
    const char *at_command = "AT#XMQTTPUB=\"/efwb/post/sync\"\r\n";

    // JSON message to be published
    const char *json_message = "{\"msg\":\"Let's go home\"}+++\r\n";

    char json_message_networkinfo[180];
    sPRINT_INFO(json_message_networkinfo, "{\"networkinfo\": \"%s\"}+++\r\n", cat_m1_at_cmd_rst.networkinfo);

//	const char *mqtt_data = "{\"shortAddress\": 2,"
//							"\"extAddress\": {\"low\": 285286663, \"high\": 0, \"unsigned\": true}+++\r\n";

    const char *mqtt_data = "{\"shortAddress\": 1,"
                            "\"extAddress\": {\"low\": 553722113, \"high\": 0, \"unsigned\": true},"
                            "\"capabilityInfo\": {\"low\": 553722113, \"high\": 0, \"unsigned\": true},"
                            "\"active\": \"true\","
                            "\"pid\": \"0xA021\","
                            "\"temperaturesensor\": {\"ambienceTemp\": 111, \"objectTemp\": 222},"
                            "\"lightsensor\": {\"rawData\": 333},"
                            "\"bandData\": {"
                                "\"start_byte\": 170,"
                                "\"sample_count\": 6,"
                                "\"fall_detect\": 0,"
                                "\"battery_level\": 30,"
                                "\"hrConfidence\": 100,"
                                "\"spo2Confidence\": 0,"
                                "\"hr\": 82,"
                                "\"spo2\": 0,"
                                "\"motionFlag\": 0,"
                                "\"scdState\": 1,"
                                "\"activity\": 0,"
                                "\"walk_steps\": 0,"
                                "\"run_steps\": 0,"
                                "\"x\": 731,"
                                "\"y\": -3,"
                                "\"z\": 687,"
                                "\"t\": 2819,"
                                "\"h\": 100953"
                            "},"
                            "\"rssi\": -36,"
                            "\"reportingInterval\": 2000,"
                            "\"pollingInterval\": \"always on device\""
                            "}+++\r\n";

    if (send_at_command(at_command))
    {
        PRINT_INFO("AT command sent successfully.\r\n");
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
        return;
    }

    if (send_at_command(json_message_networkinfo))
    {
        PRINT_INFO("JSON message sent successfully.\r\n");
    }
    else
    {
        PRINT_INFO("Failed to send JSON message.\r\n");
    }
    send_at_command("AT#XMQTTCON=0\r\n");
}

void send_Status_Band(cat_m1_Status_Band_t *status)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];
/*
    snPRINT_INFO(mqtt_data, sizeof(mqtt_data),
        "{\"bid\": %u,"
        "\"pid\": %u,"
        "\"rssi\": %u,"
        "\"start_byte\": %u,"
        "\"hr\": %u,"
        "\"spo2\": %u,"
        "\"motionFlag\": %u,"
        "\"scdState\": %u,"
        "\"activity\": %u,"
        "\"walk_steps\": %u,"
        "\"run_steps\": %u,"
        "\"temperature\": %u,"
        "\"pres\": %u,"
        "\"battery_level\": %u"
        "}+++\r\n",
        status->bid, status->pid, status->rssi, status->start_byte,
        status->hr, status->spo2, status->motionFlag, status->scdState,
        status->activity, status->walk_steps, status->run_steps,
        status->temperature, status->pres, status->battery_level);
*/
    snprintf(mqtt_data, sizeof(mqtt_data),
        "{\"extAddress\": {\"low\": %u, \"high\": 0},"
    	"\"pid\": \"0x%X\","
        "\"bandData\": {"
            "\"start_byte\": %u,"
            "\"sample_count\": 0,"
            "\"fall_detect\": 0,"
            "\"battery_level\": %u,"
            "\"hr\": %u,"
            "\"spo2\": %u,"
            "\"hrConfidence\": 100,"
            "\"spo2Confidence\": 100,"
            "\"motionFlag\": %u,"
            "\"scdState\": %u,"
            "\"activity\": %u,"
            "\"walk_steps\": %u,"
            "\"run_steps\": %u,"
            "\"x\": 0,"
            "\"y\": 0,"
            "\"z\": 0,"
            "\"t\": %u,"
            "\"h\": %d"
        "},"
        "\"rssi\": %d"
        "}+++\r\n",
		(unsigned int)status->bid, status->pid, status->start_byte,
        status->battery_level, status->hr, status->spo2,
        status->motionFlag, status->scdState, status->activity,
		(unsigned int)status->walk_steps, (unsigned int)status->run_steps, (unsigned int)status->temperature, status->pres, status->rssi
    );

//  if (send_at_command(NEW_BAND_TOPIC))

    if (send_at_command(OLD_BAND_TOPIC))
    {
        PRINT_INFO("OLD_BAND_TOPIC AT command sent successfully.\r\n");
        if (send_at_command(mqtt_data))
        {
            PRINT_INFO("JSON send_Status_Band message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send OLD_BAND_TOPIC AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
    //cell_locationFlag = true;
}

void send_Status_BandAlert(cat_m1_Status_BandAlert_t* alertData)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];
//    snprintf(mqtt_data, sizeof(mqtt_data),
//    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
//        "\"hr_alert\": %d,"
//        "\"spo2_alert\": %d"
//    	"}+++\r\n",
//		(unsigned int)alertData->bid, alertData->hr_alert, alertData->spo2_alert);
    snprintf(mqtt_data, sizeof(mqtt_data),
		"{\"extAddress\": {\"low\": %u, \"high\": 0},"
		"\"type\": %d,"
		"\"value\": %d"
		"}+++\r\n",
		(unsigned int)alertData->bid, alertData->type, alertData->value);

//  if (send_at_command(NEW_BANDALERT_TOPIC))

    if (send_at_command(OLD_BANDALERT_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");
        if (send_at_command(mqtt_data))
        {
            PRINT_INFO("JSON send_Status_BandAlert message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
}

void send_Status_FallDetection(cat_m1_Status_FallDetection_t* fallData)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];
    snprintf(mqtt_data, sizeof(mqtt_data),
    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
        "\"type\": %d,"
        "\"value\": %d"
    	"}+++\r\n",
		(unsigned int)fallData->bid, fallData->type, fallData->fall_detect);

//  if (send_at_command(NEW_FALLDETECTION_TOPIC))

    if (send_at_command(OLD_FALLDETECTION_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");
        if (send_at_command(mqtt_data))
        {
            memset(&cat_m1_Status_FallDetection, 0, sizeof(cat_m1_Status_FallDetection));
            PRINT_INFO("JSON send_Status_FallDetection message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
}

void send_GPS_Location(cat_m1_Status_GPS_Location_t* location)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[256];

    snprintf(mqtt_data, sizeof(mqtt_data),
    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
    	"\"data\": \"%s\""
        "}+++\r\n",
		(unsigned int)location->bid, cat_m1_at_cmd_rst.gps);

    if (send_at_command(GPS_LOCATION_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");

        if (send_at_command(mqtt_data))
        {
//        	osDelay(5000);
//            memset(&cat_m1_at_cmd_rst.gps, 0, sizeof(cat_m1_at_cmd_rst.gps));
            PRINT_INFO("JSON send_GPS_Location message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
    gpsSendFlag = true;
}

void send_UUID(cat_m1_Status_uuid_t* uuid)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];

    snprintf(mqtt_data, sizeof(mqtt_data),
    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
    	"\"data\": \"%s\""
        "}+++\r\n",
		(unsigned int)uuid->bid, cat_m1_at_cmd_rst.uuid);

    if (send_at_command(UUID_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");

        if (send_at_command(mqtt_data))
        {
            memset(&cat_m1_at_cmd_rst.uuid, 0, sizeof(cat_m1_at_cmd_rst.uuid));
            PRINT_INFO("JSON message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
}

void send_Fall_Difference_Value(cat_m1_Status_Fall_Difference_Value_t* Fall_Difference)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];

    snprintf(mqtt_data, sizeof(mqtt_data),
    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
    	"\"data\": \"%d\""
    	"\"accScal_data\": \"%d\""
        "}+++\r\n",
		(unsigned int)Fall_Difference->bid, Fall_Difference->data, Fall_Difference->accScal_data);

    if (send_at_command(FALLDETECTION_CHECK_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");

        if (send_at_command(mqtt_data))
        {
            memset(&cat_m1_at_cmd_rst.uuid, 0, sizeof(cat_m1_at_cmd_rst.uuid));
            PRINT_INFO("JSON message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
}

void send_Status_IMU(cat_m1_Status_IMU_t* imu_data)
{
	cat_m1_Status.mqttChecking = 1;
    char mqtt_data[1024];

    snprintf(mqtt_data, sizeof(mqtt_data),
    	"{\"extAddress\": {\"low\": %u, \"high\": 0},"
        "\"acc_x\": %d,"
        "\"acc_y\": %d,"
        "\"acc_z\": %d,"
        "\"gyro_x\": %d,"
        "\"gyro_y\": %d,"
        "\"gyro_z\": %d,"
        "\"mag_x\": %d,"
        "\"mag_y\": %d,"
        "\"mag_z\": %d,"
    	"}+++\r\n",
		(unsigned int)imu_data->bid, imu_data->acc_x, imu_data->acc_y, imu_data->acc_z,
		imu_data->gyro_x, imu_data->gyro_y, imu_data->gyro_z,
		imu_data->mag_x, imu_data->mag_y, imu_data->mag_z);

    if (send_at_command(IMU_TOPIC))
    {
        PRINT_INFO("AT command sent successfully.\r\n");
        if (send_at_command(mqtt_data))
        {
            PRINT_INFO("JSON message sent successfully.\r\n");
        }
        else
        {
            PRINT_INFO("Failed to send JSON message.\r\n");
        }
    }
    else
    {
        PRINT_INFO("Failed to send AT command.\r\n");
    }
    cat_m1_Status.mqttChecking = 0;
}

