thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
void nrf9160_Get_gps()
{
    switch (gpsState)
    {
        case GPS_INIT:
        	cat_m1_Status.gpsChecking = 1;
#if !defined(nRF9160_KT)
            send_at_command("AT#XMQTTCON=0\r\n");
#endif
            cat_m1_Status.retryCount = 0;
#if defined(nRF9160_KT)
            gpsState = GPS_ON;
#else
            gpsState = GPS_SYSTEM_MODE;
#endif
            break;

        case GPS_SYSTEM_MODE:
            if (cat_m1_Status.systemModeStatus == 0 || cat_m1_Status.systemModeStatus == 1)
            {
                send_at_command("AT+CFUN=0\r\n");
                send_at_command("AT%XSYSTEMMODE=0,0,1,0\r\n");
                osDelay(200);
                send_at_command("AT%XSYSTEMMODE?\r\n");
                osDelay(2000);
                cat_m1_Status.retryCount++;

                if (cat_m1_Status.retryCount >= 60)
                {
                	catM1Reset();
                    //gpsState = GPS_COMPLETE;
                }
            }
            else
            {
                gpsState = GPS_CFUN;
                cat_m1_Status.retryCount = 0;
            }
            break;

        case GPS_CFUN:
            if (!cat_m1_Status.cfunStatus)
            {
                send_at_command("AT+CFUN=31\r\n");
                osDelay(200);
                send_at_command("AT+CFUN?\r\n");
                osDelay(2000);
                cat_m1_Status.retryCount++;

                if (cat_m1_Status.retryCount >= 60)
                {
                	catM1Reset();
                    //gpsState = GPS_COMPLETE;
                }
            }
            else
            {
                gpsState = GPS_ON;
                cat_m1_Status.retryCount = 0;
            }
            break;

        case GPS_ON:
            if (!cat_m1_Status.gpsOn)
            {
#if defined(nRF9160_KT)
            	send_at_command("AT#XGPS=1,1,0,300\r\n");
#else
                send_at_command("AT#XGPS=1,0,0,180\r\n");
#endif

                osDelay(2000);
                send_at_command("AT#XGPS?\r\n");

                if (cat_m1_Status.parseResult == 0)
                {
                    send_at_command("AT#XGPS=0\r\n");
                    osDelay(1000);
                    cat_m1_Status.errorCount = 0;

                }

                osDelay(500);
                cat_m1_Status.retryCount++;

                if (cat_m1_Status.retryCount >= 60)
                {
                	catM1Reset();
                    //gpsState = GPS_COMPLETE;
                }
            }
            else
            {
                gpsState = GPS_COMPLETE;
            }
            break;

        case GPS_COMPLETE:
            HAL_UART_Receive_IT(&huart1, &uart_cat_m1_rx.temp, 1);
            cat_m1_Status.Checked = 2;
            //ehg.gpsFlag = false;
            gpsState = GPS_INIT;
            break;
    }
}

void nrf9160_Stop_gps()
{
	send_at_command("AT#XGPS=0\r\n");
#if !defined(nRF9160_KT)
	send_at_command("AT+CFUN=0\r\n");
	currentWpmState = WPM_INIT_CHECK;
	currentCheckState = SYSTEM_MODE_CHECK;
	currentMqttState = MQTT_INIT;
	gpsState = GPS_INIT;
	cat_m1_Status.InitialLoad = 0;
	cat_m1_Status.Checked = 0;
	cat_m1_Status.connectionStatus = 0;
	cat_m1_Status.mqttConnectionStatus = 0;
	cat_m1_Status.mqttSubscribeStatus = 0;
	cat_m1_Status.cfunStatus = 0;
	cat_m1_Status.systemModeStatus = 0;


	cat_m1_Status.mqttSetStatus = 0;
	wpmInitializationFlag = 1;
#endif
	cat_m1_Status.gpsChecking = 0;
	cat_m1_Status.gpsOn = 0;
	cat_m1_Status.gpsOff = 0;
	gpsOffCheckTime = 0;
	//cell_locationFlag = true;
	HAL_UART_Receive_IT(&huart1, &uart_cat_m1_rx.temp, 1);
}

void nrf9160_Get_gps_State()
{
	send_at_command("AT#XGPS?\r\n");
	osDelay(1000);
}

void nrf9160_Get_cell_location()
{
	send_at_command("AT%NCELLMEAS\r\n");
	osDelay(5000);
	send_at_command("AT#XNRFCLOUDPOS=2,0\r\n");
}

void nrf9160_Get_rssi()
{
	send_at_command("AT+CESQ\r\n");
}

void nrf9160_Get_time()
{
	send_at_command("AT+CCLK?\r\n");
}

void catM1Reset()
{
	wpmInitializationFlag = 0;
	currentWpmState = WPM_INIT_CHECK;
	currentCheckState = SYSTEM_MODE_CHECK;
	currentMqttState = MQTT_INIT;
	gpsState = GPS_INIT;
	cat_m1_Status.InitialLoad = 0;
	cat_m1_Status.Checked = 0;
	cat_m1_Status.connectionStatus = 0;
	cat_m1_Status.mqttConnectionStatus = 0;
	cat_m1_Status.mqttSubscribeStatus = 0;
	cat_m1_Status.bootCount = 0;
	cat_m1_Status.errorCount = 0;
	cat_m1_Status.gpsChecking = 0;
	cat_m1_Status.mqttChecking = 0;
	cat_m1_Status.cfunStatus = 0;
	cat_m1_Status.systemModeStatus = 0;
	cat_m1_Status.retryCount = 0;
	cat_m1_Status.gpsOn = 0;
	cat_m1_Status.gpsOff = 0;
	cat_m1_Status.mqttSetStatus = 0;
	gps_operation_cycle = 60*10;
	cell_locationFlag = true;
	catM1PWRGPIOInit();
	//send_at_command("AT+CFUN=0\r\n");
}

void catM1nRFCloud_Init()
{
	send_at_command("AT#XUUID\r\n");
	osDelay(1000);
	// Disable modem functionality
	send_at_command("AT+CFUN=4\r\n");
	osDelay(5000);
	// Delete previous certificates in slots 0, 1, 2
	send_at_command("AT%CMNG=3,16842753,0\r\n");
	osDelay(5000);
	send_at_command("AT%CMNG=3,16842753,1\r\n");
	osDelay(5000);
	send_at_command("AT%CMNG=3,16842753,2\r\n");
	osDelay(5000);
	// caCert
	send_at_command(caCert);
	osDelay(5000);
	// clientCert
	send_at_command(clientCert);
	osDelay(5000);
	// privateKey
	send_at_command(privateKey);
	osDelay(5000);
	send_at_command("AT%CMNG=1\r\n");
	nRFCloudFlag = 1;


}

void catM1PWRGPIOInit()
{
	// PWR ON
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
	osDelay(100);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);
}

// 윤년을 확인하는 함수
int is_leap_year(int year) {
    return ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0));
}

// 각 월별 일 수를 반환하는 함수 (윤년 고려)
int get_days_in_month(int year, int month) {
    int days_in_month[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};

    // 2월은 윤년이면 29일
    if (month == 2 && is_leap_year(year)) {
        return 29;
    }
    return days_in_month[month - 1];  // month는 1부터 시작하므로 -1
}

// UTC -> KST 변환 함수
void utc_to_kst(catM1Time *time) {
    // 9시간 더하기 (UTC -> KST)
    time->hour += 9;

