thiathat20/gui_resolution_test/Drivers/CatM1/nrf9160.c
    // 시간이 24시를 초과할 경우
    if (time->hour >= 24) {
        time->hour -= 24;  // 24를 넘으면 다시 0시부터 시작
        time->day += 1;    // 날짜를 하루 증가

        // 월말을 초과했는지 확인 (윤년 고려)
        int days_in_this_month = get_days_in_month(time->year, time->month);
        if (time->day > days_in_this_month) {
            time->day = 1;  // 다음 달로 넘어감
            time->month += 1;  // 월을 1 증가

            // 12월을 초과하면 연도를 증가
            if (time->month > 12) {
                time->month = 1;  // 1월로 초기화
                time->year += 1;  // 연도를 1 증가
            }
        }
    }
}

catM1Time getCatM1Time(void){
	catM1Time nowTime;

	char year[3];
	strncpy(year, &cat_m1_at_cmd_rst.time[2], 2);
	year[2] = '\0';

	char month[3];
	strncpy(month, &cat_m1_at_cmd_rst.time[5], 2);
	month[2] = '\0';

	char day[3];
	strncpy(day, &cat_m1_at_cmd_rst.time[8], 2);
	day[2] = '\0';

	char hour[3];
	strncpy(hour, &cat_m1_at_cmd_rst.time[11], 2);
	hour[2] = '\0';

	char min[3];
	strncpy(min, &cat_m1_at_cmd_rst.time[14], 2);
	min[2] = '\0';

	char sec[3];
	strncpy(sec, &cat_m1_at_cmd_rst.time[17], 2);
	sec[2] = '\0';


	nowTime.year = (int)atoi(year);
	nowTime.month = (int)atoi(month);
	nowTime.day = (int)atoi(day);
	nowTime.hour = (int)atoi(hour);
	nowTime.min = (int)atoi(min);
	nowTime.sec = (int)atoi(sec);

	utc_to_kst(&nowTime);

	return nowTime;
}

// Function to convert catM1Time to time_t
// Assumes the input is valid and within a valid range
time_t convertToTimeT(catM1Time dt) {
    struct tm t = {0};
    t.tm_year = dt.year - 1900; // tm_year is years since 1900
    t.tm_mon = dt.month - 1;   // tm_mon is 0-based (0 = January)
    t.tm_mday = dt.day;
    t.tm_hour = dt.hour;
    t.tm_min = dt.min;
    t.tm_sec = dt.sec;
    return mktime(&t);
}

// Function to determine if the difference between two catM1Time inputs is 1 minute or less
bool isDifferenceWithinNMinute(catM1Time dt1, catM1Time dt2, uint16_t thresholdTime) {
    time_t time1 = convertToTimeT(dt1);
    time_t time2 = convertToTimeT(dt2);

    // Get the absolute difference in seconds
    double difference = difftime(time1, time2);

    return difference <= thresholdTime && difference >= (-1*thresholdTime); // Check if difference is within 1 minute
}

void setTimeUpdatFlag(uint8_t flag)
{
  timeUpdateFlag = flag;
}

uint8_t getTimeUpdatFlag(void)
{
  return timeUpdateFlag;
}
